app/views/tweets/new.html.erb

  <p>
    <%= f.select :user_id, User.all.collect{|u|[u.name, u.id]} %>
---
SELECT "users".* FROM "users"