app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("created_at", "photo", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2016-02-26 22:11:11.106030"], ["photo", "hola, soy una imagen"], ["updated_at", "2016-02-26 22:11:11.106030"], ["user_id", 1]]