app/controllers/tweets_controller.rb

	def index
		@tweets = Tweet.all
		@tweets_de_bootcamp = User.find(1).tweets
---
SELECT "tweets".* FROM "tweets"
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "tweets".* FROM "tweets"  WHERE "tweets"."user_id" = ?  [["user_id", 1]]

	def edit
		@tweet = Tweet.find(params[:id])
---
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id" = ? LIMIT 1  [["id", 0]]

	def create
		@tweet = Tweet.new(tweet_params)
		@tweet.save
---
INSERT INTO "tweets" ("created_at", "message", "updated_at") VALUES (?, ?, ?)  [["created_at", "2016-02-23 22:15:57.791017"], ["message", "Hola"], ["updated_at", "2016-02-23 22:15:57.791017"]]

	def update
		@tweet = Tweet.find(params[:id])
		@tweet.update(tweet_params)
---
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tweets" SET "message" = ?, "updated_at" = ? WHERE "tweets"."id" = 1  [["message", "Hola edit"], ["updated_at", "2016-02-24 21:42:46.856280"]]

	def destroy
		@tweet = Tweet.find(params[:id])
		@tweet.destroy
---
SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id" = ? LIMIT 1  [["id", 11]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 11]]